//Вам необхідно вказати, яким буде результат операції та описати крок за кроком у вигляді коментарів, як відбувається перетворення в кожному прикладі:
//Вам необхідно вказати, яким буде результат операції та описати крок за кроком у вигляді коментарів, як відбувається перетворення в кожному прикладі:

console.log('number' + 3 + 3)  


// Там виходить number33, тому що считує як текст з самого початку number + 3 + 3

console.log(null + 3)

// null = 0, тому вийде 0 + 3 = 3


console.log(5 && "qwerty")


// && повертає останнє значення яке дозволяє сказати що вираз відповідає true, в даному випадку це qwerty

console.log(+'40' + +'2' + "hillel")


//оператор + конвертує данні в цифри (40 і 2, 40+2 = 42). "hillel" це стрінг, тому поєднуємо і отримуємо 42hillel.

console.log('10' - 5 === 6)


// буде false, бо 5 не дорівнює 6 (як я знаю джава любить зводити до цифр)

console.log(true + false)

// true = 1; false = 0; 1+0 = 1

console.log('4px' - 3)

// 4px не може бути чисельним значенням, бо маємо PX, то ж це NaN; Nan - 3 = Nan

console.log('4' - 3)

// 4-3 = 1


console.log('6' + 3 ** 0)

// 61. Можливо тому що 3 в степені нуля буде один, а далі воно рахує, як текст і з'єднало 6+1 = 61. Але не розумію чому воно не порахувало. Ааа, згадала, можливо, тому + намагається з'єднувати, а - рахувати

console.log(12 / '6')

// 12/6 = 2


console.log('10' + (5 === 6))


// 10false, бо 5 не дорівнює 6 тому фолс, а потім з'єднало , бо 10 - це текст 


console.log(null == '')


// false, думаю тому що тут два різні значення

console.log(3 ** (9 / 3))


// 3 в степені 3 = 27. Чому 3 на три, бо 9 / 3 = 3


console.log(!!'false' == !!'true')

// Бо фолс, там як текст, що є не пустим знаеченням. Два не пустих однакових значень = true


console.log(0 || '0' && 1)

// Бо 0 - це не правдиве значення. Перше правдиве значення - 1, тому відповідь 1.

console.log((+null == false) < 1)

// false, бо +null = 0 та фолс = 0. Тому значення є рівні та тру. А тру = 1.  А 1 не більше 1. Вони рівні. 

console.log(false && true || true)

// true, перше - це false && true, тому тут фолс, бо немає правильного значення. Але оператор || шукає перше правильне значення. Тому це ми пропускаємо, та читаємо далі. А далі йде true - що правильне значення. Тому в консолі відповідно тру.  

console.log(false && (false || true))

//false, тому що не всі значення тру. Але дивно, бо (false || true) в дужках спільне значення також тру. Виходить воно читає все. 

console.log((+null == false) < 1 ** 5)

//false, бо 1 ** 5 = 1, а (+null == false) = тру, а тру = 1, тому не буде  1<1